{
  "backend/main.mo": "Main Motoko canister implementing access control, user profiles, trade journal types, and CRUD for custom columns and trades with authorization checks.",
  "backend/migration.mo": "Minimal migration module returning state unchanged.",
  "feature_evidence.json": "Feature evidence report linking new frontend column features to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s responsibilities and recent additions including new date fields.",
  "frontend/index.css": "Empty CSS file placeholder.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component toggling between the calculations table and supplier report views.",
  "frontend/src/components/business/BusinessCalculationsTable.tsx": "Main editable table component handling create, edit, delete, validation, custom columns, and new SOR/Order date fields.",
  "frontend/src/components/business/DeleteRecordDialog.tsx": "Confirmation dialog for deleting a record with shadcn UI components.",
  "frontend/src/components/business/EditableCell.tsx": "Reusable editable cell supporting text, number, date, and select inputs with validation.",
  "frontend/src/components/business/ManageColumnsDialog.tsx": "Dialog for adding, renaming, reordering, and deleting custom columns using React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for business records and custom columns using mock data and localStorage.",
  "frontend/src/index.css": "Defines Tailwind styles, color variables, dark mode, and print-specific formatting rules.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/BusinessCalculationsTablePage.tsx": "Displays and manages business records with create, update, delete, and column management UI.",
  "frontend/src/pages/SupplierWiseReportPage.tsx": "Generates a supplier‑grouped report with subtotals, CSV export, and print support.",
  "frontend/src/types/businessRecord.ts": "Defines BusinessRecord and CustomColumn types plus status constants.",
  "frontend/src/utils/calculations.ts": "Provides utility functions for amount calculations and currency formatting.",
  "frontend/src/utils/exportSupplierReportCsv.ts": "Generates a supplier report CSV by compiling grouped records, subtotals, and a grand total, then triggers a file download.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based parameters.",
  "frontend/src/utils/validation.ts": "Implements simple number validation and safe number parsing for form inputs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend UI.",
  "project_state.json": "Describes the project’s current state, features, issues, and design goals for a business calculation web app."
}